# SpotElevTextHorizOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevTextHorizOffset Property
ParameterTypeId Class See Also
---
"Text Offset from Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevTextHorizOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevTextHorizOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevTextHorizOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace